namespace delosfera_server.Modules.Notifications.Models;

/// <summary>
/// Степень важности уведомления - используется фронтом для выбора цвета/иконки.
/// Т.е "О чём", серьёзность, "насколько важно", "сообщение", "успех операции"
/// Успех будет зеленым, серьезное уведомление красным, предупреждение коричневым, сообщение синим и т.д.
/// </summary>
public enum NotificationSeverity
{
    Info = 0,     // нейтральное информационное сообщение - синий
    Success = 1,  // успешное завершение действия - зеленый 
    Warning = 2,  // требует внимания, но не критично (например, замечания) - коричневый
    Urgent = 3    // требует немедленной реакции (например, отклонение, новая задача с дедлайном) - красный
}

